<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Load-the-database" data-toc-modified-id="Load-the-database-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Load the database</a></span></li><li><span><a href="#Assessment-3" data-toc-modified-id="Assessment-3-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Assessment 3</a></span></li><li><span><a href="#Create-database" data-toc-modified-id="Create-database-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create database</a></span></li><li><span><a href="#Connect-to-the-database" data-toc-modified-id="Connect-to-the-database-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Connect to the database</a></span></li><li><span><a href="#Create-table-students" data-toc-modified-id="Create-table-students-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Create table students</a></span></li><li><span><a href="#INSERT-some-data-into-the-tables" data-toc-modified-id="INSERT-some-data-into-the-tables-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>INSERT some data into the tables</a></span></li></ul></div>

# Load the database

In [13]:
import numpy as np
import pandas as pd
import sys
sys.path.append('../utils')

import psycopg2
import util_database
from util_database import *

display(show_method_attributes(util_database))

dbname, dbuser, dbpass, dbport = get_postgres_configs('school')
%load_ext sql
%sql postgres://postgres:$dbpass@localhost:$dbport/$dbname

,0,1
0,execute_query,show_all_tables_primary_keys
1,get_all_tables_names_in_database,show_df_tables_first_value_and_dtype
2,get_conn,show_given_tables_info
3,get_dataframe_of_all_tables_and_all_columns,show_method_attributes
4,get_pandas_dataframe,show_pandas_dataframes_list
5,get_postgres_configs,show_tables_primary_keys

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: postgres@school'

# Assessment 3
Complete the following task:

Create a new database called "School" this database should have two tables: teachers and students.

The students table should have columns for student_id, first_name,last_name, homeroom_number, phone,email, and graduation year.

The teachers table should have columns for teacher_id, first_name, last_name,

homeroom_number, department, email, and phone.

The constraints are mostly up to you, but your table constraints do have to consider the following:

 We must have a phone number to contact students in case of an emergency.
 We must have ids as the primary key of the tables
Phone numbers and emails must be unique to the individual.
Once you've made the tables, insert a student named Mark Watney (student_id=1) who has a phone number of 777-555-1234 and doesn't have an email. He graduates in 2035 and has 5 as a homeroom number.

Then insert a teacher names Jonas Salk (teacher_id = 1) who as a homeroom number of 5 and is from the Biology department. His contact info is: jsalk@school.org and a phone number of 777-555-4321.

# Create database
- Go to pgadmin and create the database.

# Connect to the database

In [3]:
print(get_postgres_configs.__doc__)

Get the configs for postgres database.

    Example:
    ========
    dbname, dbuser, dbpass, dbport = get_postgres_configs('dvdrental')
    %load_ext sql
    %sql postgres://postgres:$dbpass@localhost:$dbport/$dbname

In [4]:
dbname, dbuser, dbpass, dbport = get_postgres_configs('school')
%load_ext sql
%sql postgres://postgres:$dbpass@localhost:$dbport/$dbname

'Connected: postgres@school'

# Create table students

In [5]:
%sql drop table if exists students
%sql drop table if exists teachers

 * postgres://postgres:***@localhost:5432/school
Done.
 * postgres://postgres:***@localhost:5432/school
Done.

[]

In [6]:
%%sql
create table students(
student_id serial primary key,
first_name varchar(50) not null,
last_name varchar(50) not null,
homeroom_number int  unique,
phone varchar(20) not null unique,
email varchar(512) unique,
graduation_year int
);

 * postgres://postgres:***@localhost:5432/school
Done.

[]

In [7]:
%%sql
create table teachers(
teacher_id serial primary key,
first_name varchar(50) not null,
last_name varchar(50) not null,
homeroom_number int  unique,
phone varchar(20) not null unique,
email varchar(512) unique,
department varchar(512)
);

 * postgres://postgres:***@localhost:5432/school
Done.

[]

# INSERT some data into the tables

In [8]:
%%sql
insert into students(first_name, last_name, phone,graduation_year,homeroom_number)
values
('Mark', 'Watney','777-555-1234',2035,5);

 * postgres://postgres:***@localhost:5432/school
1 rows affected.

[]

In [9]:
%sql select * from students;

 * postgres://postgres:***@localhost:5432/school
1 rows affected.

[(1, 'Mark', 'Watney', 5, '777-555-1234', None, 2035)]

In [10]:
%%sql
insert into teachers(first_name, last_name, phone,department,homeroom_number,email)
values
('Jonas', 'Salk','777-555-4321','Biology',5,'jsalk@school.org');

 * postgres://postgres:***@localhost:5432/school
1 rows affected.

[]

In [11]:
%sql select * from teachers;

 * postgres://postgres:***@localhost:5432/school
1 rows affected.

[(1, 'Jonas', 'Salk', 5, '777-555-4321', 'jsalk@school.org', 'Biology')]